In [3]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Info on Unique Values

In [5]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [6]:
df['col2'].nunique()

3

In [9]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [12]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [14]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

### Selecting Data

In [13]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

### Appling Functions

In [15]:
def times2(x):
    return x**2

In [16]:
df['col1'].sum()

10

In [18]:
df['col1'].apply(times2) #-> for applying custom/buitlin functions in a dataframe

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [20]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [24]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [25]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

**Get column and index names:**

In [11]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [17]:
df.index

RangeIndex(start=0, stop=4, step=1)

**Sorting and Ordering a DataFrame:**

In [9]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

**Find Null Values or Check for Null Values**

In [10]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [34]:
# Drop rows with NaN Values
df.dropna()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [38]:
df.at[0,'col2']= np.nan
df

   col1   col2 col3
0     1    NaN  abc
1     2  555.0  def
2     3  666.0  ghi
3     4  444.0  xyz

In [40]:
df.dropna()

   col1   col2 col3
1     2  555.0  def
2     3  666.0  ghi
3     4  444.0  xyz

In [42]:
df.at[0,'col2'] = 444

**Filing the NaN value with something else**

In [7]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                  'col2':[np.nan,555,666,444],
                  'col3':['abc','def','ghi','xyz']})

In [8]:
df.head() #--> this is same as df to run

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [10]:
df.fillna('FILLED')

     col1    col2 col3
0     1.0  FILLED  abc
1     2.0   555.0  def
2     3.0   666.0  ghi
3  FILLED   444.0  xyz

In [11]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [12]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [13]:
df.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN